// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let number = parseInt(prompt("Введіть ваше число:"));

let result = number;

while (result > 1) {
    if (result % 3 !== 0) {
        console.log(number + " не можна отримати шляхом зведення числа 3 у деякий ступінь.");
        break;
    }
    result /= 3;
}

if (result === 1) {
    console.log(number + " можна отримати шляхом зведення числа 3 у деякий ступінь.");
} else if (result <= 0) {
    console.log("Введене число не є додатнім.");
}